<h2>3장 pandas</h2>

In [7]:
import pandas 
pandas.__version__

'2.2.2'

In [1]:
import pandas as pd

In [2]:
import numpy as np

<h3>pandas series 객체</h3>
인덱싱 된 1차원 배열로
리스트나 배열로부터 만들 수 있다.

In [25]:

data= pd.Series([0.25,0.5,0.75,1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [4]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [5]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
data[1]

0.5

In [7]:
data[1:3]

1    0.50
2    0.75
dtype: float64

In [27]:
"""series:일반화된 numpy 배열"""
data=pd.Series([0.205,0.5,0.75,1.0],index=['a','b','c','d'])
data

a    0.205
b    0.500
c    0.750
d    1.000
dtype: float64

In [30]:
data['b'],type(data),type(data.values), data.dtype

(0.5, pandas.core.series.Series, numpy.ndarray, dtype('float64'))

In [11]:
"""연속적이지 않은 인덱스"""
data=pd.Series([0.205,0.5,0.75,1.0],index=[2,3,5,7])
data

2    0.205
3    0.500
5    0.750
7    1.000
dtype: float64

In [12]:
"""Series :특수한 딕셔너리"""
population_dict = {
    'california' : 38332521,
    'florida' : 19552860
}

population=pd.Series(population_dict)
population

california    38332521
florida       19552860
dtype: int64

In [15]:
population['califonia':'florida']

california    38332521
florida       19552860
dtype: int64

In [16]:
"""series : 객체 구성하기"""
"""pd.Series(data, index=index)"""
pd.Series([2,4,6])

0    2
1    4
2    6
dtype: int64

In [17]:
pd.Series(5, index=[100,200,300])

100    5
200    5
300    5
dtype: int64

In [19]:
"""index는 딕셔너리 키를 정렬해서 취한다."""
pd.Series({2:'a' , 1: 'b', 3:'c'}, index=[3,2])

3    c
2    a
dtype: object

<h3>pandas dataframe 객체</h3>
유연한 행 인덱스와 유연한 열 이름을 가진 2차원 배열

In [33]:
area_dict = {'california'  :423967 , 'florida' : 695662}
area=pd.Series(area_dict)
area

california    423967
florida       695662
dtype: int64

In [43]:
states = pd.DataFrame({'population' : population , 'area' : area})
states, states.head(), states.columns, len(states)

(            population    area
 california    38332521  423967
 florida       19552860  695662,
             population    area
 california    38332521  423967
 florida       19552860  695662,
 Index(['population', 'area'], dtype='object'),
 2)

In [44]:
type(states), type(states['area'])

(pandas.core.frame.DataFrame, pandas.core.series.Series)

In [35]:
"""열"""
states.index

Index(['california', 'florida'], dtype='object')

In [37]:
"""열"""
states.columns

Index(['population', 'area'], dtype='object')

In [38]:
states['area']

california    423967
florida       695662
Name: area, dtype: int64

In [39]:
"""단일 series 객체에서 구성하기"""
pd.DataFrame(population, columns=['population'])

            population
california    38332521
florida       19552860

In [40]:
"""딕셔너리의 리스트에서 구성하기"""
data=[{'a':i, 'b':2*i} for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [42]:
pd.DataFrame([{'a':1, 'b':2}, {'b':3, 'c':4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

<h3>데이터 정보 잠시 보는 방법
    head()
info()
describe()</h3>

In [45]:
"""head() 앞쪽부터 5개 , tail() 끝에서부터"""
df = pd.read_csv('data/president_heights.csv')
df.head()

   order               name  height(cm)
0      1  George Washington         189
1      2         John Adams         170
2      3   Thomas Jefferson         189
3      4      James Madison         163
4      5       James Monroe         183

In [50]:
df['height(cm)'] , type(df['height(cm)']), df['height(cm)'].dtype

(0     189
 1     170
 2     189
 3     163
 4     183
 5     171
 6     185
 7     168
 8     173
 9     183
 10    173
 11    173
 12    175
 13    178
 14    183
 15    193
 16    178
 17    173
 18    174
 19    183
 20    183
 21    168
 22    170
 23    178
 24    182
 25    180
 26    183
 27    178
 28    182
 29    188
 30    175
 31    179
 32    183
 33    193
 34    182
 35    183
 36    177
 37    185
 38    188
 39    188
 40    182
 41    185
 42    191
 43    182
 Name: height(cm), dtype: int64,
 pandas.core.series.Series,
 dtype('int64'))

In [51]:
np.average( df['height(cm)'])

180.04545454545453

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44 entries, 0 to 43
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order       44 non-null     int64
 1   name        44 non-null     object
 2   height(cm)  44 non-null     int64
dtypes: int64(2), object(1)
memory usage: 1.2+ KB

In [53]:
df.describe()

           order  height(cm)
count  44.000000   44.000000
mean   23.522727  180.045455
std    13.729087    7.064337
min     1.000000  163.000000
25%    11.750000  174.750000
50%    24.000000  182.000000
75%    35.250000  183.500000
max    46.000000  193.000000

<h3>pandas index 객체</h3>

In [54]:
ind= pd.Index([2,3,5,7,11])
ind

Index([2, 3, 5, 7, 11], dtype='int64')

In [55]:
ind[1]

3

In [56]:
ind[::2]

Index([2, 5, 11], dtype='int64')

In [58]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

In [64]:
"""index객체와 numpy 배열의 한가지 차이점이라면 indexr는 일반적인 방법으로는 변경될 수 없는 불변의 값이라느 점이다."""
"""ind[1]=0"""

'ind[1]=0'

In [71]:
indA= pd.Index([1,3,5,7,9])
indB= pd.Index([2,3,5,7,11])

In [76]:
"""교집합"""
indA.intersection(indB)

Index([3, 5, 7], dtype='int64')

In [77]:
"""합집합"""
indA.union(indB)

Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [78]:
"""차집합"""
indA.difference(indB)

Index([1, 9], dtype='int64')

<h3>데이터 인덱싱과 선택</h3>

<h3>1)series 에서 데이터 선택</h3>

In [98]:
data=pd.Series([0.25,0.5], index=['a','b'])
data

a    0.25
b    0.50
dtype: float64

In [80]:
data['b']

0.5

In [81]:
'a' in data

True

In [83]:
data.keys()

Index(['a', 'b'], dtype='object')

In [84]:
list(data.items())

[('a', 0.25), ('b', 0.5)]

In [99]:
"""새로운 값 할당"""
data['c']=1.25
data

a    0.25
b    0.50
c    1.25
dtype: float64

In [86]:
data['a':'c']

a    0.25
b    0.50
c    1.25
dtype: float64

In [87]:
"""암묵적 인덱스일 경우 최종인덱스가 제외된다."""
data[:2]

a    0.25
b    0.50
dtype: float64

In [101]:
"""마스킹"""
test_mask= (data>0.3) & (data<0.8)
data[test_mask]

b    0.5
dtype: float64

In [89]:
"""팬시 인덱싱"""
data[['a','c']]

a    0.25
c    1.25
dtype: float64

In [90]:
"""loc와 iloc"""
data= pd.Series(['a','b','c'], index=[1,2,3])
data

1    a
2    b
3    c
dtype: object

In [91]:
"""명시적 인덱싱"""
data[1]

'a'

In [92]:
"""암묵적  인덱싱"""
data[0:2]

1    a
2    b
dtype: object

In [93]:
"""정수인덱스를 사용하는 경우 혼선이 발생할 수 있기 때문에 인덱스 방식을 명시적으로 드러내는 인덱서 속성 제공"""
"""loc, iloc"""
data.loc[1]

'a'

data.loc[1:3]

In [95]:
data.iloc[1]

'b'

In [96]:
data.iloc[1:3]

2    b
3    c
dtype: object

In [102]:
"""head() 앞쪽부터 5개 , tail() 끝에서부터"""
df = pd.read_csv('data/president_heights.csv')
df.head()

   order               name  height(cm)
0      1  George Washington         189
1      2         John Adams         170
2      3   Thomas Jefferson         189
3      4      James Madison         163
4      5       James Monroe         183

In [106]:
df.loc[1,'name':'height']

name          John Adams
height(cm)           170
Name: 1, dtype: object

In [107]:
df.iloc[1,1:3]

name          John Adams
height(cm)           170
Name: 1, dtype: object

<h3>2)dataframe에서 데이터 선택</h3>

In [129]:


df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [111]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [130]:
"""새로운 컬럼 만들기"""
df['survived_rate']=df['Survived']/1
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,survived_rate
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0.0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1.0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0.0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1.0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0.0

In [131]:
df.values, df.values.shape

(array([[1, 0, 3, ..., nan, 'S', 0.0],
        [2, 1, 1, ..., 'C85', 'C', 1.0],
        [3, 1, 3, ..., nan, 'S', 1.0],
        ...,
        [889, 0, 3, ..., nan, 'S', 0.0],
        [890, 1, 1, ..., 'C148', 'C', 1.0],
        [891, 0, 3, ..., nan, 'Q', 0.0]], dtype=object),
 (891, 13))

In [132]:
df_copy = df.values.T
df_copy, df_copy.shape

(array([[1, 2, 3, ..., 889, 890, 891],
        [0, 1, 1, ..., 0, 1, 0],
        [3, 1, 3, ..., 3, 1, 3],
        ...,
        [nan, 'C85', nan, ..., nan, 'C148', nan],
        ['S', 'C', 'S', ..., 'S', 'C', 'Q'],
        [0.0, 1.0, 1.0, ..., 0.0, 1.0, 0.0]], dtype=object),
 (13, 891))

In [117]:
df.iloc[:5,4:]

,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,survived_rate
0,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0.0
1,female,38.0,1,0,PC 17599,71.2833,C85,C,1.0
2,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1.0
3,female,35.0,1,0,113803,53.1000,C123,S,1.0
4,male,35.0,0,0,373450,8.0500,NaN,S,0.0

In [134]:
df.loc[:4,'Sex':'survived_rate'] , type(df.loc[:4,'Sex':'survived_rate'])

(      Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked  \
 0    male  22.0      1      0         A/5 21171   7.2500   NaN        S
 1  female  38.0      1      0          PC 17599  71.2833   C85        C
 2  female  26.0      0      0  STON/O2. 3101282   7.9250   NaN        S
 3  female  35.0      1      0            113803  53.1000  C123        S
 4    male  35.0      0      0            373450   8.0500   NaN        S

    survived_rate
 0            0.0
 1            1.0
 2            1.0
 3            1.0
 4            0.0  ,
 pandas.core.frame.DataFrame)

In [137]:
df.loc[df['Survived']==1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,survived_rate
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1.0
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S,1.0
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C,1.0
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C,1.0
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S,1.0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1.0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1.0

<h3>loc(조건),iloc(슬라이싱)의 리턴타입은 dataframe, series이다.pandas사용에 수월하다</h3>
<h3>values의 리턴타입은 array이다.numpy로 이용하기에 수월하다.</h3>

In [122]:
df.iloc[0,4]='female'
df.iloc[0,1]=0
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,survived_rate
0,1,0,3,"Braund, Mr. Owen Harris",female,22.0,1,0,A/5 21171,7.2500,NaN,S,0.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0.0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1.0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0.0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1.0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0.0

<h3> pandas에서 데이터 연산하기</h3>

In [123]:
rng=np.random.RandomState(42)
ser=pd.Series(rng.randint(0,10,4))
ser

0    6
1    3
2    7
3    4
dtype: int32

In [124]:
type(ser), type(ser.values), ser[0].dtype

(pandas.core.series.Series, numpy.ndarray, dtype('int32'))

In [125]:
df=pd.DataFrame(rng.randint(0,10,(3,4)), columns=['A','B','C','D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [126]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [127]:
np.sin(df*np.pi/4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

In [142]:
"""SERIES에서 인덱스 정렬"""
area=pd.Series({'Alaska':1723337, 'taxas':695662, 'california':423967}, name='area')
population=pd.Series({'taxas':26448193, 'california':38332521, 'newyork':19651127}, name='population')

In [143]:
population/area

Alaska              NaN
california    90.413926
newyork             NaN
taxas         38.018740
dtype: float64

In [146]:
area.index.union(  population.index)

Index(['Alaska', 'california', 'newyork', 'taxas'], dtype='object')

In [165]:
A=pd.Series([2,4,6],index=[0,1,2])
B=pd.Series([1,3,5],index=[1,2,3])

In [166]:
A

0    2
1    4
2    6
dtype: int64

In [167]:
B

1    1
2    3
3    5
dtype: int64

In [179]:
"pandas에서 인덱스가 중요하다"""
A+B

      A     B   C
0  19.0  20.0 NaN
1   8.0   3.0 NaN
2   NaN   NaN NaN

In [180]:
"""누락된 요소의 채우기 값을 선택해 명시적으로 지정"""
A.add(B, fill_value=0)

      A     B    C
0  19.0  20.0  7.0
1   8.0   3.0  3.0
2   7.0   1.0  3.0

In [170]:
"""dataframe에서 인덱스 정렬"""
A=pd.DataFrame(rng.randint(0,20,(2,2)), columns=list('AB'))
A

    A   B
0  13  17
1   8   1

In [171]:
B=pd.DataFrame(rng.randint(0,10,(3,3)), columns=list('BAC'))
B

   B  A  C
0  3  6  7
1  2  0  3
2  1  7  3

In [172]:
A+B

      A     B   C
0  19.0  20.0 NaN
1   8.0   3.0 NaN
2   NaN   NaN NaN

In [173]:
A.add(B, fill_value=0)

      A     B    C
0  19.0  20.0  7.0
1   8.0   3.0  3.0
2   7.0   1.0  3.0

In [175]:
fill=A.stack().mean()
A.add(B, fill_value=fill)

       A      B      C
0  19.00  20.00  16.75
1   8.00   3.00  12.75
2  16.75  10.75  12.75

In [158]:
A=rng.randint(10, size=(3,4))
A

array([[3, 8, 2, 4],
       [2, 6, 4, 8],
       [6, 1, 3, 8]])

In [159]:
A-A[0]

array([[ 0,  0,  0,  0],
       [-1, -2,  2,  4],
       [ 3, -7,  1,  4]])

In [161]:
df=pd.DataFrame(A, columns=list('QRST'))
df-df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -1 -2  2  4
2  3 -7  1  4

In [162]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0 -5  0 -6 -4
1 -4  0 -2  2
2  5  0  2  7

<h3>누락된 데이터 처리하기</h3>

In [215]:
"""891이 최대값이라 하면 Age,  Cabin, Embarked는 891보다 작으므로 데이터가 누락되었을 것이다.=>np.nansum()과 같이 연산해야한다."""
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [181]:
vals1=np.array([1,None, 2, 3])
vals1

array([1, None, 2, 3], dtype=object)

In [182]:
"""none을 사용한 산술연산을 지원하지 않는다."""
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [196]:
"""nan:부동소수점표기 사용"""
vals2=np.array([1,np.nan, 2, 3])
vals2, vals2.dtype

(array([ 1., nan,  2.,  3.]), dtype('float64'))

In [184]:
1+np.nan

nan

In [185]:
0*np.nan

nan

In [186]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [187]:
"""nan을 무시하는 계산"""
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(6.0, 1.0, 3.0)

In [189]:
"""nan과 None의 호환성 처리"""
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [191]:
x=pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int32

In [192]:
x[0]=None
x

0    NaN
1    1.0
dtype: float64

In [193]:
pd.Series([1,np.nan , 2, None, pd.NA], dtype='Int32')

0       1
1    <NA>
2       2
3    <NA>
4    <NA>
dtype: Int32

In [197]:
"""널값 탐지"""
data=pd.Series([1, np.nan, 'hello', None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [198]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [200]:
"""널값 제거"""
data.dropna() , data.dropna().size

(0        1
 2    hello
 dtype: object,
 2)

In [202]:
"""dataframe에 index, columns 안 주면 기본적으로 0,1,2순서대로 나열"""
df = pd.DataFrame([[1,np.nan,2], [2,3,5],[np.nan, 4,6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [203]:
"""널 값 있는 행 제거"""
df.dropna()

     0    1  2
1  2.0  3.0  5

In [204]:
"""널 값 있는 열 제거"""
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [205]:
"""유호한 일부 데이터를 유지하기 위해, how=ant, all을 사용한다."""
df[3]=np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [206]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [209]:
df.dropna(axis='columns', how='any')

   2
0  2
1  5
2  6

In [208]:
"""널 아닌 값이 최소 3개 있어야 행 삭제 하지 않음"""
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [211]:
df.dropna(axis='columns', thresh=3)

   2
0  2
1  5
2  6

In [216]:
"""널값 채우기"""
data=pd.Series([1, np.nan, 'hello', None])
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [217]:
data.fillna(0)

0        1
1        0
2    hello
3        0
dtype: object

In [218]:
"""이전 값으로 채우기"""
data.fillna(method='ffill')

C:\Users\user\AppData\Local\Temp\ipykernel_9040\1844443866.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='ffill')

0        1
1        1
2    hello
3    hello
dtype: object

In [219]:

data=pd.Series([1, np.nan, 'hello', None,2])
data

0        1
1      NaN
2    hello
3     None
4        2
dtype: object

In [220]:
"""다음에 오는 값으로 채우기"""
data.fillna(method='bfill')

C:\Users\user\AppData\Local\Temp\ipykernel_9040\1397359497.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='bfill')

0        1
1    hello
2    hello
3        2
4        2
dtype: object

<h3>타이타닉 csv 누락 데이터 채우기</h3>

In [221]:
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [233]:
df_copy =df.copy()
df_copy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [236]:
"""null값이 있는 행을 삭제하면 유효한 값까지 삭제되어 행 개수가 891에서 183이 된다."""

df_drop=df_copy.dropna()
df_drop

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [244]:
aver=np.sum(df_drop['Age'])//183
aver

35.0

In [247]:
df_copy.fillna(aver)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,35.0,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,35.0,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,35.0,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,35.0,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,35.0,1,2,W./C. 6607,23.4500,35.0,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,35.0,Q

In [248]:
df_copy.fillna(np.sum(df_copy.dropna()['Age'])//183)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,35.0,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,35.0,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,35.0,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,35.0,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,35.0,1,2,W./C. 6607,23.4500,35.0,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,35.0,Q